// 常量表
export default {
  TYPE: {
    SEX: {
      0: '男',
      1: '女',
    },
    SEX_ZN: {
      男: 0,
      女: 1,
    },
    SEX_EN: {
      male: 0,
      female: 1,
    },
    TAGS: {
      0: '学校',
      1: '公司',
      2: '家',
    },
  },
  COLOR: {
    MT: '#ffd161',
  },
  // 店铺页-筛选
  fliterList: {
    complex: '综合排序',
    speed: '速度最快',
    rate: '评分最高',
    threshold: '起送价最低',
    freight: '配送费最低',
    perCapitaDec: '人均高到低',
    perCapitaAsc: '人均低到高',
  },
  // 订单状态
  ORDER_STATUS: {
    0: '等待支付',
    1: '已支付',
    2: '送达中',
    3: '已送达',
    4: '订单已完成',
    5: '退款中',
    6: '订单已取消',
  },
  // 订单状态对应的消息
  ORDER_STATUS_MSG: {
    0: '请在15分钟内完成支付，超时将自动取消',
    1: '已支付',
    2: '送达中',
    3: '已送达',
    4: '感谢您对美团外卖的信任，期待再次光临',
    5: '退款中',
    6: '您的订单已取消',
  },
};
